mozolin/ESP32C6_Zigbee/main/esp32c6_zigbee.c
#include "esp32c6_zigbee.h"
#include "esp_check.h"
#include "esp_err.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "string.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "zcl/esp_zigbee_zcl_common.h"
#include "zigbee_logo.h"
#include "zigbee_connected.h"
#include "zigbee_disconnected.h"
#include "zigbee_image.h"
#include "iot_button.h"
#include <time.h>
#include <sys/time.h>

#include "driver/i2c.h"
#include "ssd1306.h"
#include "led_strip.h"
#include "bmx280.h"
#include "ds18b20_main.h"
#if USE_BH1750_SENSOR
  #include "bh1750.h"
#endif

//------ Global definitions -----------
static char
  manufacturer[16],
  model[16],
  firmware_version[16];
bool
  time_updated = false,
  connected = false,
  ds18b20_found = false,
  updateAttributeStarted = false;
int lcd_timeout = 30;
uint8_t
  screen_number = 0,
  s_led_state = 0; 
uint16_t
  temperature = 0,
  humidity = 0,
  pressure = 0,
  temperature2 = 0,
  undefined_value = 0x8000;
float
  t = 0,
  p = 0,
  h = 0,
  t2 = 0,
  //temp_ds18b20 = 0,
  l = 0;
char strftime_buf[64];
static ssd1306_handle_t ssd1306_dev = NULL;
SemaphoreHandle_t i2c_semaphore = NULL;
static const char *TAG_ESP32C6 = "ESP32C6_ZIGBEE";
extern int ds18b20_device_num;
extern float ds18b20_temperature_list[ONEWIRE_MAX_DS18B20];
#if USE_BH1750_SENSOR
  uint16_t lIntBH1750 = 0;
  float lBH1750 = 0;
  uint16_t lBH1750Raw = 0;
  
  //-- arrays for val and raw from bh1750_red()
  float arrlBH1750[1];
  uint16_t arrlBH1750Raw[1];
  //float lBH1750Data[2];
  //static const char *TAG_BH1750 = "BH1750";
#endif
//char degree[]="\u00b0";
//char degree[]=0xDF;
//char degree[]="°";


static void blink_led(void)
{
  gpio_set_level(BLINK_GPIO, s_led_state);
}
static void configure_led(void)
{
  gpio_reset_pin(BLINK_GPIO);
  gpio_set_direction(BLINK_GPIO, GPIO_MODE_OUTPUT);
}

static void do_blink()
{
  s_led_state = 1;
  blink_led();

  vTaskDelay(500 / portTICK_PERIOD_MS);

  s_led_state = 0;
  blink_led();
  //vTaskDelete(NULL);
}

static void button_single_click_cb(void *arg,void *usr_data)
{
  ESP_LOGI("Button boot", "Single click, change screen to %d", screen_number);
  lcd_timeout = 30;
  screen_number = screen_number + 1;
  if( screen_number == 2)
  {
    screen_number = 0;
  }
}

static void button_long_press_cb(void *arg,void *usr_data)
{
  ESP_LOGI("Button boot", "Long press, leave & reset");
  esp_zb_factory_reset();
}

void register_button()
{
  //-- create GPIO button
  button_config_t gpio_btn_cfg = {
    .type = BUTTON_TYPE_GPIO,
    .long_press_time = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
    .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
    .gpio_button_config = {
      .gpio_num = 9,
      .active_level = 0,
    },
  };

  button_handle_t gpio_btn = iot_button_create(&gpio_btn_cfg);
  if(NULL == gpio_btn) {
    ESP_LOGE("Button boot", "Button create failed");
  }

  iot_button_register_cb(gpio_btn, BUTTON_SINGLE_CLICK, button_single_click_cb,NULL);
  iot_button_register_cb(gpio_btn, BUTTON_LONG_PRESS_START, button_long_press_cb, NULL);

}

esp_err_t i2c_master_init()
{
  //-- Don't initialize twice!
  if(i2c_semaphore != NULL) {
    return ESP_FAIL;
  }
        
  i2c_semaphore = xSemaphoreCreateMutex();
  if(i2c_semaphore == NULL) {
    return ESP_FAIL;
  }
        
  i2c_config_t i2c_config = {
    .mode = I2C_MODE_MASTER,
    .sda_io_num = GPIO_NUM_6,
    .scl_io_num = GPIO_NUM_7,
    .sda_pullup_en = GPIO_PULLUP_ENABLE,
    .scl_pullup_en = GPIO_PULLUP_ENABLE,
    .master.clk_speed = 1000000
  };

  esp_err_t ret;

  ret = i2c_param_config(I2C_NUM_0, &i2c_config);
  if(ret != ESP_OK)
  {
    return ret;
  }
        
  ret = i2c_driver_install(I2C_NUM_0, I2C_MODE_MASTER, 0, 0, 0);
  if(ret != ESP_OK)
  {
    return ret;
  }
        
  return ESP_OK;
}

//--------- User task section -----------------
static void get_rtc_time()
{
  time_t now;
  struct tm timeinfo;
  time(&now);
  localtime_r(&now, &timeinfo);
  strftime(strftime_buf, sizeof(strftime_buf), "%a %H:%M:%S", &timeinfo);    
}

void lcd_screen_0()
{
	ssd1306_refresh_gram(ssd1306_dev);
	ssd1306_clear_screen(ssd1306_dev, 0x00);

	char temp_data_str[100] = {0};
	int i = 0;
	for(i = 0; i < ds18b20_device_num; i ++) {
		t2 = ds18b20_temperature_list[i];
		sprintf(temp_data_str, "ds18b20[%d]: %.2f", i, t2);
		//ssd1306_draw_string(ssd1306_dev, 0, 26 + i * 12, (const uint8_t *)temp_data_str, 12, 1);
		ssd1306_draw_string(ssd1306_dev, 0, 15 + i * 12, (const uint8_t *)temp_data_str, 12, 1);
	}

	#if USE_BH1750_SENSOR
    //-- BH1750
    i = 3; //-- 4th row on SSD1036
    sprintf(temp_data_str, "bh1750: %.2f", lBH1750);
    ssd1306_draw_string(ssd1306_dev, 0, 15 + i * 12, (const uint8_t *)temp_data_str, 12, 1);
  #endif

	sprintf(temp_data_str, "%.2f, %.2f%%, %.0f", t, h, p/100);
	//ssd1306_draw_string(ssd1306_dev, 0, 14, (const uint8_t *)temp_data_str, 12, 1);
	ssd1306_draw_string(ssd1306_dev, 0, 5, (const uint8_t *)temp_data_str, 12, 1);
	//ESP_LOGI("4", "T2: %.2f, T: %.2f, H: %.2f, P: %.0f", t2, t, h, p);

	ssd1306_draw_bitmap(ssd1306_dev, 112, 48, zigbee_image, 16, 16);
	if (connected)
	{
		//ESP_LOGW("LCD", "CONNECTED!");
		ssd1306_draw_bitmap(ssd1306_dev, 112, 0, zigbee_connected, 16, 16);
	} else {
		//ESP_LOGE("LCD", "NOT CONNECTED!");
		ssd1306_draw_bitmap(ssd1306_dev, 112, 0, zigbee_disconnected, 16, 16);
	}
	ssd1306_refresh_gram(ssd1306_dev);
}

void lcd_screen_1()
{
  ssd1306_refresh_gram(ssd1306_dev);
  ssd1306_clear_screen(ssd1306_dev, 0x00);
  ssd1306_draw_bitmap(ssd1306_dev, 112, 48, zigbee_image, 16, 16);
  if(connected)
  {
    if(time_updated)
    {
      get_rtc_time();
      ESP_LOGI(TAG_ESP32C6, "The current date/time is: %s", strftime_buf);
      ssd1306_draw_string(ssd1306_dev, 5, 48, (const uint8_t *)strftime_buf, 16, 1);
    }

    char connected_str[16] = {0};
    char PAN_ID[16] = {0};
    char Channel[16] = {0};
    sprintf(connected_str, "  Connected");
    sprintf(PAN_ID, "PAN ID : 0x%04hx", esp_zb_get_pan_id());
    sprintf(Channel, "Channel: %d", esp_zb_get_current_channel());
    ssd1306_draw_string(ssd1306_dev, 5, 0, (const uint8_t *)connected_str, 16, 1);
    ssd1306_draw_string(ssd1306_dev, 5, 16, (const uint8_t *)PAN_ID, 16, 1);
    ssd1306_draw_string(ssd1306_dev, 5, 32, (const uint8_t *)Channel, 16, 1);
    ssd1306_draw_bitmap(ssd1306_dev, 112, 0, zigbee_connected, 16, 16);
  } else {
    char disconnected_str[16] = {0};
    sprintf(disconnected_str, " Disconnected");
    ssd1306_draw_string(ssd1306_dev, 5, 16, (const uint8_t *)disconnected_str, 16, 1);
    ssd1306_draw_bitmap(ssd1306_dev, 112, 0, zigbee_disconnected, 16, 16);
  }
  ssd1306_refresh_gram(ssd1306_dev);
}

static void lcd_task(void *pvParameters)
{
  //-- Start lcd
  ssd1306_dev = ssd1306_create(I2C_NUM_0, SSD1306_I2C_ADDRESS);
  ssd1306_refresh_gram(ssd1306_dev);
  ssd1306_clear_screen(ssd1306_dev, 0x00);

  ssd1306_draw_bitmap(ssd1306_dev, 0, 16, zigbee, 128, 32);
  ssd1306_refresh_gram(ssd1306_dev);
  vTaskDelay(1500 / portTICK_PERIOD_MS);
  
  while(1)
  {  
    switch(screen_number) {
      case 0:
        //ESP_LOGI(TAG_ESP32C6, "Screen number 0 ");
        lcd_screen_0();
        break;
      case 1:
        //ESP_LOGI(TAG_ESP32C6, "Screen number 1 ");
        lcd_screen_1();
        break;
      default:
        ESP_LOGW(TAG_ESP32C6, "Default screen --------");
        break;  
    }
    lcd_timeout = lcd_timeout - 1;
    if(lcd_timeout <= 0) {
      screen_number = 0;
    } else {
      lcd_timeout = lcd_timeout - 1;
      //ESP_LOGI(TAG_ESP32C6, "lcd_timeout %d ", lcd_timeout);
    }
    vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
}

