mozolin/ESP32C6_Zigbee/main/esp32c6_zigbee.c
#if USE_BH1750_SENSOR
static void bh1750_task(void *pvParameters)
{
  while(1) {
	  bh1750_read(arrlBH1750, arrlBH1750Raw);
	  lBH1750 = arrlBH1750[0];
	  lBH1750Raw = arrlBH1750Raw[0];

	  lIntBH1750 = (uint16_t)(lBH1750 * 10000);
	  //ESP_LOGI(TAG_BH1750, "val:%.2f, int:%d, raw:%d", lBH1750, lIntBH1750, lBH1750Raw);
    
    vTaskDelay(5000 / portTICK_PERIOD_MS);
  }
  
  vTaskDelete(NULL);
}
#endif

static void bmx280_task(void *pvParameters)
{
  bmx280_t* bmx280 = bmx280_create(I2C_NUM_0);

  if(!bmx280) { 
    ESP_LOGE("BMX280", "Could not create bmx280 driver.");
    return;
  }

  ESP_ERROR_CHECK(bmx280_init(bmx280));
  bmx280_config_t bmx_cfg = BMX280_DEFAULT_CONFIG;
  ESP_ERROR_CHECK(bmx280_configure(bmx280, &bmx_cfg));

  while(1)
  {
    ESP_ERROR_CHECK(bmx280_setMode(bmx280, BMX280_MODE_FORCE));
    do {
      vTaskDelay(5000 / portTICK_PERIOD_MS);
    } while(bmx280_isSampling(bmx280));
    //vTaskDelay(5000 / portTICK_PERIOD_MS);
    ESP_ERROR_CHECK(bmx280_readoutFloat(bmx280, &t, &p, &h));
    //ESP_LOGI("BMX280", "Read Values: t = %.2f, p = %.1f, h = %.1f", t, p/100, h);
    temperature = (uint16_t)(t * 100);
    humidity = (uint16_t)(h * 100);
    pressure = (uint16_t)(p/100);

    ds18b20_show();

    if(ds18b20_device_num > 0) {
    	ds18b20_found = true;
    }

    char ds18b20_str[200] = {0};
    char ds18b20_int[10] = {0};
    //strcpy(ds18b20_str, "");
    //strcpy(ds18b20_int, "");
    for(int i = 0; i < ds18b20_device_num; i ++) {
      t2 = ds18b20_temperature_list[i];
      //ESP_LOGI(TAG_DS18B20, "Temperature read from DS18B20[%d]: %.2fC", i, t2);
      if(strlen(ds18b20_str) > 0) {
      	strcat(ds18b20_str, ", ");
      }
      sprintf(ds18b20_int, "%.2f", t2);
      strcat(ds18b20_str, ds18b20_int);
    }

    #if USE_BH1750_SENSOR
      ESP_LOGI("BMX280|DS18B20|BH1750", "T=%.2fC, H=%.2f%%, P=%.0fhPa | DS18B20: %d/%d dev(s) => %s | %.2fLux", t, h, p/100, ds18b20_device_num, ONEWIRE_MAX_DS18B20, ds18b20_str, lBH1750);
    #else
      ESP_LOGI("BMX280|DS18B20", "T=%.2fC, H=%.2f%%, P=%.0fhPa | DS18B20: %d/%d dev(s) => %s", t, h, p/100, ds18b20_device_num, ONEWIRE_MAX_DS18B20, ds18b20_str);
    #endif
  }
}

static void ds18b20_task(void *pvParameters)
{
  while(1)
  {
    ds18b20_show();

    if(ds18b20_device_num > 0) {
    	ds18b20_found = true;
    }

    char ds18b20_str[200] = {0};
    char ds18b20_int[10] = {0};
    
    for(int i = 0; i < ds18b20_device_num; i ++) {
      t2 = ds18b20_temperature_list[i];
      //ESP_LOGI(TAG_DS18B20, "Temperature read from DS18B20[%d]: %.2fC", i, t2);
      if(strlen(ds18b20_str) > 0) {
      	strcat(ds18b20_str, ", ");
      }
      sprintf(ds18b20_int, "%.2f", t2);
      strcat(ds18b20_str, ds18b20_int);
    }

    vTaskDelay(5000 / portTICK_PERIOD_MS);
  }
}


//----------------------------------------

static void bdb_start_top_level_commissioning_cb(uint8_t mode_mask)
{
  ESP_LOGW(TAG_ESP32C6, "bdb_start_top_level_commissioning_cb()");
  ESP_ERROR_CHECK(esp_zb_bdb_start_top_level_commissioning(mode_mask));
}

//-- Manual reporting attribute to coordinator
static void reportAttribute(uint8_t srcEndpoint, uint8_t dstEndpoint, uint16_t clusterID, uint16_t attributeID, void *value, uint8_t value_length)
{
  esp_zb_zcl_report_attr_cmd_t cmd = {
    .zcl_basic_cmd = {
      .dst_addr_u.addr_short = 0x0000,
      .src_endpoint = srcEndpoint,
      .dst_endpoint = dstEndpoint,
    },
    .address_mode = ESP_ZB_APS_ADDR_MODE_16_ENDP_PRESENT,
    .clusterID = clusterID,
    .attributeID = attributeID,
    .cluster_role = ESP_ZB_ZCL_CLUSTER_SERVER_ROLE,
  };
  esp_zb_zcl_attr_t *value_r = esp_zb_zcl_get_attribute(srcEndpoint, clusterID, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, attributeID);
  memcpy(value_r->data_p, value, value_length);
  esp_zb_zcl_report_attr_cmd_req(&cmd);

  vTaskDelay(500 / portTICK_PERIOD_MS);
}

//-- Task for update attribute value
void update_attribute()
{
  while(1)
  {
    if(connected)
    {
      ESP_LOGW("UPD_ATTR", "CONNECTED!");
      //ESP_LOGW(TAG_ESP32C6, "update_attribute(%d - %d - %d)", temperature, humidity, pressure);
      esp_zb_zcl_status_t state_tmp = esp_zb_zcl_set_attribute_val(BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temperature, false);
      if(state_tmp != ESP_ZB_ZCL_STATUS_SUCCESS)
      {
        ESP_LOGE(TAG_ESP32C6, "Setting temperature attribute failed!");
      } else {
        reportAttribute(BMX280_SENSOR_ENDPOINT, BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temperature, 2);
      }
      esp_zb_zcl_status_t state_hum = esp_zb_zcl_set_attribute_val(BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID, &humidity, false);
      if(state_hum != ESP_ZB_ZCL_STATUS_SUCCESS)
      {
        ESP_LOGE(TAG_ESP32C6, "Setting humidity attribute failed!");
      } else {
        reportAttribute(BMX280_SENSOR_ENDPOINT, BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT, ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID, &humidity, 2);
      }
      esp_zb_zcl_status_t state_press = esp_zb_zcl_set_attribute_val(BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_PRESSURE_MEASUREMENT_VALUE_ID, &pressure, false);
      if(state_press != ESP_ZB_ZCL_STATUS_SUCCESS)
      {
        ESP_LOGE(TAG_ESP32C6, "Setting pressure attribute failed!");
      } else {
        reportAttribute(BMX280_SENSOR_ENDPOINT, BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT, ESP_ZB_ZCL_ATTR_PRESSURE_MEASUREMENT_VALUE_ID, &pressure, 2);
      }
      //ESP_LOGW("BMX280", "EP:%d", BMX280_SENSOR_ENDPOINT);

      //-- Write new temperature value for DS18B20
      for(int i = 0; i < ds18b20_device_num; i ++) {
        uint8_t DS18B20_SENSOR_ENDPOINT = BMX280_SENSOR_ENDPOINT + i + 1;
        
        //ESP_LOGE(TAG_ESP32C6, "UPDATE: DS18B20_SENSOR_ENDPOINT = %d", DS18B20_SENSOR_ENDPOINT);
        
        t2 = ds18b20_temperature_list[i];
        temperature2 = t2 * 100;
        
        //ESP_LOGW(TAG_ESP32C6, "UPDATE[%d] WITH %.2f (%d)", i, t2, temperature2);
        
        esp_zb_zcl_status_t ds18b20_state = esp_zb_zcl_set_attribute_val(DS18B20_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temperature2, false);
        if(ds18b20_state != ESP_ZB_ZCL_STATUS_SUCCESS) {
          ESP_LOGE(TAG_ESP32C6, "Setting DS18B20[%d] attribute failed!", i);
        } else {
          reportAttribute(DS18B20_SENSOR_ENDPOINT, 1, ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temperature2, 2);
          //reportAttribute(DS18B20_SENSOR_ENDPOINT, DS18B20_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &temperature2, 2);
        }
        //ESP_LOGW(TAG_ESP32C6, "REPORT_DS18B20[%d] WITH %.2f (%d)", i, t2, temperature2);
        //ESP_LOGW("DS18B20", "EP:%d", DS18B20_SENSOR_ENDPOINT);
      }

