mozolin/ESP32C6_Zigbee/main/esp32c6_zigbee.c
      #if USE_BH1750_SENSOR
        #if !USE_BH1750_CUSTOM_ENDPOINT
          //-- BH1750 (EP #1)
          //ESP_LOGE(TAG_ESP32C6, "1");
          esp_zb_zcl_status_t state_illum = esp_zb_zcl_set_attribute_val(BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, false);
          //ESP_LOGE(TAG_ESP32C6, "2");
          if(state_illum != ESP_ZB_ZCL_STATUS_SUCCESS) {
            ESP_LOGE(TAG_ESP32C6, "Setting lIntBH1750 (EP:%d) attribute failed!", BMX280_SENSOR_ENDPOINT);
          } else {
            reportAttribute(BMX280_SENSOR_ENDPOINT, BMX280_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, 2);
            //reportAttribute(1, 1, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, 2);
          }
          //ESP_LOGW("BH1750", "EP:%d", BMX280_SENSOR_ENDPOINT);
          //ESP_LOGE(TAG_ESP32C6, "3");
        #else
          //-- BH1750 (BH1750_SENSOR_ENDPOINT)
          //ESP_LOGE(TAG_ESP32C6, "1");
          esp_zb_zcl_status_t state_illum = esp_zb_zcl_set_attribute_val(BH1750_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, false);
          //ESP_LOGE(TAG_ESP32C6, "2");
          if(state_illum != ESP_ZB_ZCL_STATUS_SUCCESS) {
            ESP_LOGE(TAG_ESP32C6, "Setting lIntBH1750 (EP:%d) attribute failed!", BH1750_SENSOR_ENDPOINT);
          } else {
            reportAttribute(BH1750_SENSOR_ENDPOINT, 1, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, 2);
            //reportAttribute(BH1750_SENSOR_ENDPOINT, BH1750_SENSOR_ENDPOINT, ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &lBH1750Raw, 2);
          }
          //ESP_LOGE(TAG_ESP32C6, "3");
          //ESP_LOGW("BH1750", "EP:%d", BH1750_SENSOR_ENDPOINT);
        #endif
        //ESP_LOGE(TAG_ESP32C6, "4");
      #endif

      do_blink();

    } else {
      ESP_LOGE("UPD_ATTR", "NOT CONNECTED!");
    }
    
    vTaskDelay(UPDATE_ATTR_INTERVAL * 1000 / portTICK_PERIOD_MS);
    /*
    if(updateAttributeStarted) {
    	vTaskDelay(UPDATE_ATTR_INTERVAL * 1000 / portTICK_PERIOD_MS);
    } else {
    	vTaskDelay(5000 / portTICK_PERIOD_MS);
    	
    }
    */
    //-- first use of this function
    updateAttributeStarted = true;
  }
}

static esp_err_t zb_attribute_handler(const esp_zb_zcl_set_attr_value_message_t *message)
{
  esp_err_t ret = ESP_OK;
  ESP_RETURN_ON_FALSE(message, ESP_FAIL, TAG_ESP32C6, "Empty message");
  ESP_RETURN_ON_FALSE(message->info.status == ESP_ZB_ZCL_STATUS_SUCCESS, ESP_ERR_INVALID_ARG, TAG_ESP32C6, "Received message: error status(%d)",
    message->info.status);
  ESP_LOGI(TAG_ESP32C6, "Received message: endpoint(%d), cluster(0x%x), attribute(0x%x), data size(%d)", message->info.dst_endpoint, message->info.cluster,
    message->attribute.id, message->attribute.data.size);
  if(message->info.dst_endpoint == BMX280_SENSOR_ENDPOINT) {
    switch (message->info.cluster) {
      case ESP_ZB_ZCL_CLUSTER_ID_IDENTIFY:
        ESP_LOGI(TAG_ESP32C6, "Identify pressed");
        break;
      default:
        ESP_LOGI(TAG_ESP32C6, "Message data: cluster(0x%x), attribute(0x%x)  ", message->info.cluster, message->attribute.id);
    }
  }
  return ret;
}

static esp_err_t zb_read_attr_resp_handler(const esp_zb_zcl_cmd_read_attr_resp_message_t *message)
{
  ESP_RETURN_ON_FALSE(message, ESP_FAIL, TAG_ESP32C6, "Empty message");
    ESP_RETURN_ON_FALSE(message->info.status == ESP_ZB_ZCL_STATUS_SUCCESS, ESP_ERR_INVALID_ARG, TAG_ESP32C6, "Received message: error status(%d)",
      message->info.status);
    ESP_LOGI(TAG_ESP32C6, "Read attribute response: status(%d), cluster(0x%x), attribute(0x%x), type(0x%x), value(%d)", message->info.status,
      message->info.cluster, message->attribute.id, message->attribute.data.type,
      message->attribute.data.value ? *(uint8_t *)message->attribute.data.value : 0);
    if(message->info.dst_endpoint == BMX280_SENSOR_ENDPOINT) {
      switch (message->info.cluster) {
        case ESP_ZB_ZCL_CLUSTER_ID_TIME:
          ESP_LOGI(TAG_ESP32C6, "Server time recieved %lu", *(uint32_t*) message->attribute.data.value);
          struct timeval tv;
          //-- after adding OTA cluster time shifted to 1080 sec... strange issue ... 
          tv.tv_sec = *(uint32_t*) message->attribute.data.value + 946684800 - 1080;
          //tv.tv_sec = *(uint32_t*) message->attribute.data.value + 946684800;
          settimeofday(&tv, NULL);
          time_updated = true;
          break;
        default:
          ESP_LOGI(TAG_ESP32C6, "Message data: cluster(0x%x), attribute(0x%x)  ", message->info.cluster, message->attribute.id);
      }
    }
    return ESP_OK;
}

static esp_err_t zb_action_handler(esp_zb_core_action_callback_id_t callback_id, const void *message)
{
  esp_err_t ret = ESP_OK;
    switch (callback_id) {
    case ESP_ZB_CORE_SET_ATTR_VALUE_CB_ID:
      ret = zb_attribute_handler((esp_zb_zcl_set_attr_value_message_t *)message);
      break;
    case ESP_ZB_CORE_CMD_READ_ATTR_RESP_CB_ID:
      ret = zb_read_attr_resp_handler((esp_zb_zcl_cmd_read_attr_resp_message_t *)message);
      break;
    default:
      ESP_LOGW(TAG_ESP32C6, "Receive Zigbee action(0x%x) callback", callback_id);
      break;
    }
    return ret;
}

void read_server_time()
{
  esp_zb_zcl_read_attr_cmd_t read_req;
  read_req.address_mode = ESP_ZB_APS_ADDR_MODE_16_ENDP_PRESENT;
  read_req.attributeID = ESP_ZB_ZCL_ATTR_TIME_LOCAL_TIME_ID;
  read_req.clusterID = ESP_ZB_ZCL_CLUSTER_ID_TIME;
  read_req.zcl_basic_cmd.dst_endpoint = 1;
  read_req.zcl_basic_cmd.src_endpoint = 1;
  read_req.zcl_basic_cmd.dst_addr_u.addr_short = 0x0000;
  esp_zb_zcl_read_attr_cmd_req(&read_req);
}

void esp_zb_app_signal_handler(esp_zb_app_signal_t *signal_struct)
{
  uint32_t *p_sg_p       = signal_struct->p_app_signal;
  esp_err_t err_status = signal_struct->esp_err_status;
  esp_zb_app_signal_type_t sig_type = *p_sg_p;
  esp_zb_zdo_signal_leave_params_t *leave_params = NULL;
  switch (sig_type) {
  case ESP_ZB_BDB_SIGNAL_DEVICE_FIRST_START:
  case ESP_ZB_BDB_SIGNAL_DEVICE_REBOOT:
  case ESP_ZB_BDB_SIGNAL_STEERING:
    if(err_status != ESP_OK) {
      connected = false;
      ESP_LOGW(TAG_ESP32C6, "Stack %s failure with %s status, steering",esp_zb_zdo_signal_to_string(sig_type), esp_err_to_name(err_status));
      esp_zb_scheduler_alarm((esp_zb_callback_t)bdb_start_top_level_commissioning_cb, ESP_ZB_BDB_MODE_NETWORK_STEERING, 1000);
    } else {
      //-- device auto start successfully and on a formed network
      connected = true;
      esp_zb_ieee_addr_t extended_pan_id;
      esp_zb_get_extended_pan_id(extended_pan_id);
      ESP_LOGI(TAG_ESP32C6, "Joined network successfully (Extended PAN ID: %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x, PAN ID: 0x%04hx, Channel:%d)",
        extended_pan_id[7], extended_pan_id[6], extended_pan_id[5], extended_pan_id[4],
        extended_pan_id[3], extended_pan_id[2], extended_pan_id[1], extended_pan_id[0],
        esp_zb_get_pan_id(), esp_zb_get_current_channel());
      read_server_time();
    }
    break;
  case ESP_ZB_ZDO_SIGNAL_LEAVE:
    leave_params = (esp_zb_zdo_signal_leave_params_t *)esp_zb_app_signal_get_params(p_sg_p);
    if(leave_params->leave_type == ESP_ZB_NWK_LEAVE_TYPE_RESET) {
      ESP_LOGI(TAG_ESP32C6, "Reset device");
      esp_zb_factory_reset();
    }
    break;
  default:
    ESP_LOGI(TAG_ESP32C6, "ZDO signal: %s (0x%x), status: %s", esp_zb_zdo_signal_to_string(sig_type), sig_type,
      esp_err_to_name(err_status));
    break;
  }
}

static void set_zcl_string(char *buffer, char *value)
{
  buffer[0] = (char) strlen(value);
  memcpy(buffer + 1, value, buffer[0]);
}

