mozolin/ESP32C6_Zigbee/main/esp32c6_zigbee.c
void add_bx280_clusters(esp_zb_cluster_list_t *esp_zb_cluster_list)
{
  //-- Temperature cluster
  esp_zb_attribute_list_t *esp_zb_temperature_meas_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT);
  esp_zb_temperature_meas_cluster_add_attr(esp_zb_temperature_meas_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &undefined_value);
  esp_zb_temperature_meas_cluster_add_attr(esp_zb_temperature_meas_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MIN_VALUE_ID, &undefined_value);
  esp_zb_temperature_meas_cluster_add_attr(esp_zb_temperature_meas_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MAX_VALUE_ID, &undefined_value);
  
  //-- Humidity cluster
  esp_zb_attribute_list_t *esp_zb_humidity_meas_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT);
  esp_zb_humidity_meas_cluster_add_attr(esp_zb_humidity_meas_cluster, ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID, &undefined_value);
  esp_zb_humidity_meas_cluster_add_attr(esp_zb_humidity_meas_cluster, ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MIN_VALUE_ID, &undefined_value);
  esp_zb_humidity_meas_cluster_add_attr(esp_zb_humidity_meas_cluster, ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MAX_VALUE_ID, &undefined_value);
  
  //-- Pressure cluster
  esp_zb_attribute_list_t *esp_zb_press_meas_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT);
  esp_zb_pressure_meas_cluster_add_attr(esp_zb_press_meas_cluster, ESP_ZB_ZCL_ATTR_PRESSURE_MEASUREMENT_VALUE_ID, &undefined_value);
  esp_zb_pressure_meas_cluster_add_attr(esp_zb_press_meas_cluster, ESP_ZB_ZCL_ATTR_PRESSURE_MEASUREMENT_MIN_VALUE_ID, &undefined_value);
  esp_zb_pressure_meas_cluster_add_attr(esp_zb_press_meas_cluster, ESP_ZB_ZCL_ATTR_PRESSURE_MEASUREMENT_MAX_VALUE_ID, &undefined_value);
  
  #if USE_BH1750_SENSOR && !USE_BH1750_CUSTOM_ENDPOINT
    //-- BH1750 (BMX280_SENSOR_ENDPOINT): Create attributes list for BH1750
    esp_zb_attribute_list_t *bh1750_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT);
    esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &undefined_value);
    esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MIN_MEASURED_VALUE_ID, &undefined_value);
    esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MAX_MEASURED_VALUE_ID, &undefined_value);
  #endif

  esp_zb_cluster_list_add_temperature_meas_cluster(esp_zb_cluster_list, esp_zb_temperature_meas_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  esp_zb_cluster_list_add_humidity_meas_cluster(esp_zb_cluster_list, esp_zb_humidity_meas_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  esp_zb_cluster_list_add_pressure_meas_cluster(esp_zb_cluster_list, esp_zb_press_meas_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  #if USE_BH1750_SENSOR && !USE_BH1750_CUSTOM_ENDPOINT
    //-- BH1750 (BMX280_SENSOR_ENDPOINT): Add cluster list for BH1750
    esp_zb_cluster_list_add_illuminance_meas_cluster(esp_zb_cluster_list, bh1750_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  #endif
}

void add_ds18d20_temperature_cluster(int i, esp_zb_ep_list_t *esp_zb_ep_list)
{
  //-- Create attributes list for DS18B20
  esp_zb_attribute_list_t *ds18b20_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT);
  esp_zb_temperature_meas_cluster_add_attr(ds18b20_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &undefined_value);
  esp_zb_temperature_meas_cluster_add_attr(ds18b20_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MIN_VALUE_ID, &undefined_value);
  esp_zb_temperature_meas_cluster_add_attr(ds18b20_cluster, ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MAX_VALUE_ID, &undefined_value);
  //ESP_LOGE(TAG_ESP32C6, "ds18b20_cluster[%d]", i);
  
  //-- Create cluster list for DS18B20
  uint8_t DS18B20_SENSOR_ENDPOINT = BMX280_SENSOR_ENDPOINT + i + 1;
  //ESP_LOGE(TAG_ESP32C6, "DS18B20_SENSOR_ENDPOINT[%d] = %d", i, DS18B20_SENSOR_ENDPOINT);
  esp_zb_cluster_list_t *ds18b20_cluster_list = esp_zb_zcl_cluster_list_create();
  esp_zb_cluster_list_add_temperature_meas_cluster(ds18b20_cluster_list, ds18b20_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  esp_zb_ep_list_add_ep(esp_zb_ep_list, ds18b20_cluster_list, DS18B20_SENSOR_ENDPOINT, ESP_ZB_AF_HA_PROFILE_ID, ESP_ZB_HA_SIMPLE_SENSOR_DEVICE_ID);
}

//-- add custom BH1750_SENSOR_ENDPOINT
#if USE_BH1750_SENSOR && USE_BH1750_CUSTOM_ENDPOINT
void add_bh1750_illuminance_cluster(esp_zb_ep_list_t *esp_zb_ep_list)
{
  //-- Create attributes list for BH1750
  esp_zb_attribute_list_t *bh1750_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_ILLUMINANCE_MEASUREMENT);
  esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MEASURED_VALUE_ID, &undefined_value);
  esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MIN_MEASURED_VALUE_ID, &undefined_value);
  esp_zb_illuminance_meas_cluster_add_attr(bh1750_cluster, ESP_ZB_ZCL_ATTR_ILLUMINANCE_MEASUREMENT_MAX_MEASURED_VALUE_ID, &undefined_value);
  //ESP_LOGE(TAG_ESP32C6, "bh1750_cluster[%d]", BH1750_SENSOR_ENDPOINT);
  
  //-- Create cluster list for BH1750
  esp_zb_cluster_list_t *bh1750_cluster_list = esp_zb_zcl_cluster_list_create();
  esp_zb_cluster_list_add_illuminance_meas_cluster(bh1750_cluster_list, bh1750_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  esp_zb_ep_list_add_ep(esp_zb_ep_list, bh1750_cluster_list, BH1750_SENSOR_ENDPOINT, ESP_ZB_AF_HA_PROFILE_ID, ESP_ZB_HA_SIMPLE_SENSOR_DEVICE_ID);
}
#endif

static void esp_zb_task(void *pvParameters)
{
  //-- initialize Zigbee stack
  esp_zb_cfg_t zb_nwk_cfg = ESP_ZB_ZR_CONFIG();
  esp_zb_init(&zb_nwk_cfg);
  
  //-- basic cluster create with fully customized
  set_zcl_string(manufacturer, MANUFACTURER_NAME);
  set_zcl_string(model, MODEL_NAME);
  set_zcl_string(firmware_version, FIRMWARE_VERSION);

  esp_zb_attribute_list_t *esp_zb_basic_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_BASIC);
  esp_zb_basic_cluster_add_attr(esp_zb_basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MANUFACTURER_NAME_ID, manufacturer);
  esp_zb_basic_cluster_add_attr(esp_zb_basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MODEL_IDENTIFIER_ID, model);
  esp_zb_basic_cluster_add_attr(esp_zb_basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_SW_BUILD_ID, firmware_version);
  
  //-- identify cluster create with fully customized
  uint8_t identyfi_id;
  identyfi_id = 0;
  esp_zb_attribute_list_t *esp_zb_identify_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_IDENTIFY);
  esp_zb_identify_cluster_add_attr(esp_zb_identify_cluster, ESP_ZB_ZCL_CMD_IDENTIFY_IDENTIFY_ID, &identyfi_id);

