mozolin/ESP32C6_Zigbee/main/esp32c6_zigbee.c
  //-- Time cluster
  esp_zb_attribute_list_t *esp_zb_server_time_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_TIME);
  
  /** Create ota client cluster with attributes.
   *  Manufacturer code, image type and file version should match with configured values for server.
   *  If the client values do not match with configured values then it shall discard the command and
   *  no further processing shall continue.
   */
  esp_zb_ota_cluster_cfg_t ota_cluster_cfg = {
    .ota_upgrade_downloaded_file_ver = OTA_UPGRADE_FILE_VERSION,
    .ota_upgrade_manufacturer = OTA_UPGRADE_MANUFACTURER,
    .ota_upgrade_image_type = OTA_UPGRADE_IMAGE_TYPE,
  };
  esp_zb_attribute_list_t *esp_zb_ota_client_cluster = esp_zb_ota_cluster_create(&ota_cluster_cfg);
  //-- add client parameters to ota client cluster
  esp_zb_ota_upgrade_client_parameter_t ota_client_parameter_config = {
    //-- time interval for query next image request command
    .query_timer = ESP_ZB_ZCL_OTA_UPGRADE_QUERY_TIMER_COUNT_DEF,          
    //-- version of hardware
    .hardware_version = OTA_UPGRADE_HW_VERSION,                           
    //-- maximum data size of query block image
    .max_data_size = OTA_UPGRADE_MAX_DATA_SIZE,                           
  };
  void *ota_client_parameters = esp_zb_ota_client_parameter(&ota_client_parameter_config);
  esp_zb_ota_cluster_add_attr(esp_zb_ota_client_cluster, ESP_ZB_ZCL_ATTR_OTA_UPGRADE_CLIENT_PARAMETER_ID, ota_client_parameters);

  //-- Create full cluster list enabled on device
  esp_zb_cluster_list_t *esp_zb_cluster_list = esp_zb_zcl_cluster_list_create();
  esp_zb_cluster_list_add_basic_cluster(esp_zb_cluster_list, esp_zb_basic_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  esp_zb_cluster_list_add_identify_cluster(esp_zb_cluster_list, esp_zb_identify_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
  add_bx280_clusters(esp_zb_cluster_list);
  esp_zb_cluster_list_add_time_cluster(esp_zb_cluster_list, esp_zb_server_time_cluster, ESP_ZB_ZCL_CLUSTER_CLIENT_ROLE);
  esp_zb_cluster_list_add_ota_cluster(esp_zb_cluster_list, esp_zb_ota_client_cluster, ESP_ZB_ZCL_CLUSTER_CLIENT_ROLE);
  
  esp_zb_ep_list_t *esp_zb_ep_list = esp_zb_ep_list_create();
  esp_zb_ep_list_add_ep(esp_zb_ep_list, esp_zb_cluster_list, BMX280_SENSOR_ENDPOINT, ESP_ZB_AF_HA_PROFILE_ID, ESP_ZB_HA_SIMPLE_SENSOR_DEVICE_ID);
  
  //-- Temperature DS18B20 cluster
  for(int i = 0; i < ONEWIRE_MAX_DS18B20; i ++) {
    add_ds18d20_temperature_cluster(i,  esp_zb_ep_list);
  }

  #if USE_BH1750_SENSOR && USE_BH1750_CUSTOM_ENDPOINT
    //-- BH1750: create custom BH1750_SENSOR_ENDPOINT & add iluminance cluster
    add_bh1750_illuminance_cluster(esp_zb_ep_list);
  #endif

  //-- END
  esp_zb_device_register(esp_zb_ep_list);
  esp_zb_core_action_handler_register(zb_action_handler);
  esp_zb_set_primary_network_channel_set(ESP_ZB_PRIMARY_CHANNEL_MASK);
  ESP_ERROR_CHECK(esp_zb_start(true));
  
  esp_zb_main_loop_iteration();
  

  //vTaskDelay(10000 / portTICK_PERIOD_MS);
}

void app_main(void)
{
  register_button();
  ESP_ERROR_CHECK(i2c_master_init());

  configure_led();

  esp_zb_platform_config_t config = {
    .radio_config = ESP_ZB_DEFAULT_RADIO_CONFIG(),
    .host_config = ESP_ZB_DEFAULT_HOST_CONFIG(),
  };
  ESP_ERROR_CHECK(nvs_flash_init());
  ESP_ERROR_CHECK(esp_zb_platform_config(&config));

  xTaskCreate(lcd_task, "lcd_task", 4096, NULL, 1, NULL);
  xTaskCreate(bmx280_task, "bmx280_task",  4096, NULL, 2, NULL);
  xTaskCreate(ds18b20_init_task, "ds18b20_init_task", 4096, NULL, 3, NULL);
  xTaskCreate(ds18b20_task, "ds18b20_task", 4096, NULL, 4, NULL);
  #if USE_BH1750_SENSOR
    xTaskCreate(bh1750_task, "bh1750_task", 4096, NULL, 5, NULL);
  #endif

  xTaskCreate(esp_zb_task, "Zigbee_main", 4096, NULL, 6, NULL);
  xTaskCreate(update_attribute, "Update_attribute_value", 4096, NULL, 7, NULL);
}
